InformationRegisters/ИтогиЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИтогиЛечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Итог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИтогиДинамическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументЗакрытия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПозицииПланаМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПозицииПланаМаршрута</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНазначений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дозировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемовВДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭтапыНазначенийПланаЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЭтапыНазначенийПланаЛечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапМаршрутаПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыМаршрутаПациента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АвтоСтатусыПозицийМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АвтоСтатусыПозицийМаршрута</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФакта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыПозицийМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПозицийМаршрута</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВыполненияПозицииМаршрута</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КорректировкиПланаЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КорректировкиПланаЛечения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидКорректировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКорректировокПланаЛечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыМаршрутаПациента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНазначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНазначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дозировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемовВДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_СтатусыЗаякиНаЛабИсследованиеВЛИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаВЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученРезультатИзЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученЧастичныйРезультатИзЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьБракованныеПробы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЭтапыМаршрутаПациента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЭтапыМаршрутаПациента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Консультация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДиагностикаЛабораторная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДиагностикаИнструментальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДинамическийКонтроль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыВыполненияПозицииМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыВыполненияПозицииМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКорректировокПланаЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКорректировокПланаЛечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДобавлениеПозиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалениеПозиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПозиции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/МаршрутыПациентовСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает структуру с данными маршрута для построения отчёта.
//  ПервичныйПрием - ДокументСсылка.Прием
Функция ДанныеМаршрута(ПервичныйПрием, СтандартЛечения) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПервичныйПрием", ПервичныйПрием); 
	Результат.Вставить("СтандартЛечения", СтандартЛечения);
	Результат.Вставить("НаименованиеМаршрута",
		"Маршрут лечения «" + Строка(СтандартЛечения) + "»");
	Результат.Вставить("Корректно", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("Пациент", Неопределено);
	Результат.Вставить("ДатаНачала", '00010101');
	Результат.Вставить("ДатаПриема", '00010101');
	Результат.Вставить("ДатаОкончания", '00010101');
	Результат.Вставить("ИтогЗафиксирован", Ложь);
	Результат.Вставить("Итог", Неопределено);
	Результат.Вставить("ДатаЗакрытия", '00010101');
	Результат.Вставить("Этапы", Новый Массив);
	
	Если Не ЗначениеЗаполнено(ПервичныйПрием) Тогда
		Результат.ТекстОшибки = "Не указан первичный приём.";
		Возврат Результат;
	КонецЕсли;
	
	// Пациент и дата старта маршрута.
	РеквизитыПриема = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ПервичныйПрием, "Дата, МедицинскаяКарта");
	Пациент = ?(ЗначениеЗаполнено(РеквизитыПриема.МедицинскаяКарта),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыПриема.МедицинскаяКарта, "Клиент"),
		Неопределено);
	
	Если Не ЗначениеЗаполнено(Пациент) Тогда
		Результат.ТекстОшибки = "У первичного приёма не заполнена медкарта или пациент.";
		Возврат Результат;
	КонецЕсли;
	Результат.Пациент = Пациент;
	
	// Окно маршрута: [дата приёма - 30 дней ; дата закрытия или сегодня].
	ДатаПриема = НачалоДня(РеквизитыПриема.Дата);
	Результат.ДатаНачала = ДатаПриема - 30 * 86400; 
	Результат.ДатаПриема = ДатаПриема;
	
	ИтогМаршрута = ПрочитатьИтогЛечения(ПервичныйПрием);
	Если ИтогМаршрута <> Неопределено Тогда
		Результат.ИтогЗафиксирован = Истина;
		Результат.Итог = ИтогМаршрута.Итог;
		Результат.ДатаЗакрытия = ИтогМаршрута.ДатаЗакрытия;
		Результат.ДатаОкончания = КонецДня(ИтогМаршрута.ДатаЗакрытия);
	Иначе
		Результат.ДатаОкончания = КонецДня(НачалоДня(ТекущаяДатаСеанса()));
	КонецЕсли;
	
	// План + этапы + автостатусы + ручные статусы.
	ТаблицаПлана = ПолучитьПланСЭтапами(ПервичныйПрием, СтандартЛечения);
	ПрименитьКорректировки(ТаблицаПлана, ПолучитьКорректировки(ПервичныйПрием, СтандартЛечения));
	ПрименитьАвтоСтатусы(ТаблицаПлана, ПолучитьАвтоСтатусы(ПервичныйПрием, СтандартЛечения));
	ПрименитьРучныеСтатусы(ТаблицаПлана, ПолучитьРучныеСтатусы(ПервичныйПрием, СтандартЛечения));
	Результат.Этапы = СгруппироватьПоЭтапам(ТаблицаПлана, ПервичныйПрием, ДатаПриема);
	Результат.Корректно = Истина;
	
	Возврат Результат;
	
КонецФункции 
Процедура ПрименитьРучныеСтатусы(ТаблицаПлана, РучныеСтатусы)
	
	Для Каждого СтрокаПлана Из ТаблицаПлана Цикл
		Статус = РучныеСтатусы.Получить(СтрокаПлана.ИдентификаторНазначения);
		Если Статус <> Неопределено Тогда
			СтрокаПлана.РучнойСтатус = Статус;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьИтогЛечения(ПервичныйПрием) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИтогиЛечения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПервичныйПрием = ПервичныйПрием;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Новый Структура("Итог, ДатаЗакрытия",
		МенеджерЗаписи.Итог, МенеджерЗаписи.ДатаЗакрытия);
	
КонецФункции

Функция ПолучитьПланСЭтапами(ПервичныйПрием, СтандартЛечения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПервичныйПрием", ПервичныйПрием);
	Запрос.УстановитьПараметр("СтандартЛечения", СтандартЛечения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Позиции.ИдентификаторНазначения КАК ИдентификаторНазначения,
	|	Позиции.Номенклатура КАК Номенклатура,
	|	Позиции.ВидНазначения КАК ВидНазначения,
	|	Позиции.ДатаНачала КАК ДатаНачала,
	|	Позиции.ДатаОкончания КАК ДатаОкончания,
	|	Позиции.Количество КАК Количество,
	|	Позиции.Дозировка КАК Дозировка,
	|	Позиции.ПриемовВДень КАК ПриемовВДень,
	|	Позиции.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Этапы.ЭтапМаршрутаПациента КАК Этап,
	|	Позиции.СтандартЛечения КАК СтандартЛечения
	|ИЗ
	|	РегистрСведений.ПозицииПланаМаршрута КАК Позиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЭтапыНазначенийПланаЛечения КАК Этапы
	|		ПО Позиции.ИдентификаторНазначения = Этапы.ИдентификаторНазначения
	|			И Позиции.ПервичныйПрием = Этапы.ПервичныйПрием
	|ГДЕ
	|	Позиции.ПервичныйПрием = &ПервичныйПрием
	|	И Позиции.СтандартЛечения = &СтандартЛечения";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("ДатаФакта", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("Выполнено", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ФактВРаботе", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("РучнойСтатус");
	Таблица.Колонки.Добавить("АвтоСтатус");
	Возврат Таблица;

КонецФункции 
Функция ПолучитьАвтоСтатусы(ПервичныйПрием, СтандартЛечения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПервичныйПрием", ПервичныйПрием);
	Запрос.УстановитьПараметр("СтандартЛечения", СтандартЛечения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АвтоСтатусы.ИдентификаторНазначения КАК ИдентификаторНазначения,
	|	АвтоСтатусы.Статус КАК Статус,
	|	АвтоСтатусы.ДатаФакта КАК ДатаФакта
	|ИЗ
	|	РегистрСведений.АвтоСтатусыПозицийМаршрута КАК АвтоСтатусы
	|ГДЕ
	|	АвтоСтатусы.ПервичныйПрием = &ПервичныйПрием
	|	И АвтоСтатусы.СтандартЛечения = &СтандартЛечения";
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИдентификаторНазначения,
			Новый Структура("Статус, ДатаФакта", Выборка.Статус, Выборка.ДатаФакта));
	КонецЦикла;
	Возврат Результат;
	
КонецФункции
Процедура ПрименитьАвтоСтатусы(ТаблицаПлана, АвтоСтатусы)
	
	Для Каждого СтрокаПлана Из ТаблицаПлана Цикл
		Данные = АвтоСтатусы.Получить(СтрокаПлана.ИдентификаторНазначения);
		Если Данные <> Неопределено Тогда
			СтрокаПлана.АвтоСтатус = Данные.Статус;
			Если ЗначениеЗаполнено(Данные.ДатаФакта) Тогда
				СтрокаПлана.ДатаФакта = Данные.ДатаФакта;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРучныеСтатусы(ПервичныйПрием, СтандартЛечения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПервичныйПрием", ПервичныйПрием);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Статусы.ИдентификаторНазначения КАК ИдентификаторНазначения,
	|	Статусы.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыПозицийМаршрута КАК Статусы
	|ГДЕ
	|	Статусы.ПервичныйПрием = &ПервичныйПрием";
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИдентификаторНазначения, Выборка.Статус);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция ПолучитьФакт(Пациент, ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пациент", Пациент);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ГруппаАнализов",
		Константы.омг_ГруппаЛабораторныхИсследований.Получить());
	// СВЕРИТЬ: имя ТЧ услуг ("Работы") и реквизита клиента ("Клиент") документа ОказаниеУслуг.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Работы.Номенклатура КАК Номенклатура,
	|	Работы.Ссылка.Дата КАК Дата,
	|	ИСТИНА КАК Выполнено,
	|	ЛОЖЬ КАК ЭтоАнализ
	|ИЗ
	|	Документ.ОказаниеУслуг.Работы КАК Работы
	|ГДЕ
	|	Работы.Ссылка.Клиент = &Пациент
	|	И Работы.Ссылка.Проведен
	|	И Работы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ Работы.Номенклатура В ИЕРАРХИИ (&ГруппаАнализов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Анализы.Номенклатура,
	|	Анализы.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА Анализы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ПолученРезультатИзЛИС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ИСТИНА
	|ИЗ
	|	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Анализы КАК Анализы
	|ГДЕ
	|	Анализы.Ссылка.Пациент = &Пациент
	|	И Анализы.Ссылка.Проведен
	|	И Анализы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Анализы.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Отменена)
	|	И Анализы.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ОтклоненоЛИС)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Сопоставление факта с планом по номенклатуре и хронологии (вариант А).
Процедура СопоставитьФакт(ТаблицаПлана, ТаблицаФакта) Экспорт
	
	ЛучшийСтатусАнализа = Новый Соответствие;
	ДатаЛучшегоСтатуса = Новый Соответствие;
	
	// --- Обычные услуги: список фактов по номенклатуре, по дате ---
	ФактУслугПоНоменклатуре = Новый Соответствие;
	
	Для Каждого СтрокаФакта Из ТаблицаФакта Цикл
		
		Если СтрокаФакта.ЭтоАнализ Тогда
			
			Вес = ?(СтрокаФакта.Выполнено, 2, 1);
			Текущий = ЛучшийСтатусАнализа.Получить(СтрокаФакта.Номенклатура);
			Если Текущий = Неопределено ИЛИ Вес > Текущий Тогда
				ЛучшийСтатусАнализа.Вставить(СтрокаФакта.Номенклатура, Вес);
				ДатаЛучшегоСтатуса.Вставить(СтрокаФакта.Номенклатура, СтрокаФакта.Дата);
			КонецЕсли;
			
		Иначе
			
			Список = ФактУслугПоНоменклатуре.Получить(СтрокаФакта.Номенклатура);
			Если Список = Неопределено Тогда
				Список = Новый Массив;
				ФактУслугПоНоменклатуре.Вставить(СтрокаФакта.Номенклатура, Список);
			КонецЕсли;
			Список.Добавить(Новый Структура("Дата, Выполнено",
				СтрокаФакта.Дата, СтрокаФакта.Выполнено));
			
		КонецЕсли;
		
	КонецЦикла;
	
	// --- Применяем к плану ---
	СписокНоменклатур = Новый Массив;
	Для Каждого СтрокаПлана Из ТаблицаПлана Цикл
		Если ТипЗнч(СтрокаПлана.Номенклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда
			Продолжить;
		КонецЕсли;
		Если СписокНоменклатур.Найти(СтрокаПлана.Номенклатура) = Неопределено Тогда
			СписокНоменклатур.Добавить(СтрокаПлана.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Номенклатура Из СписокНоменклатур Цикл
		
		СтрокиПлана = ТаблицаПлана.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
		
		ВесАнализа = ЛучшийСтатусАнализа.Получить(Номенклатура);
		
		Если ВесАнализа <> Неопределено Тогда
			
			// Анализ: всем позициям этой номенклатуры — лучший статус.
			Для Каждого СтрокаПлана Из СтрокиПлана Цикл
				СтрокаПлана.ДатаФакта = ДатаЛучшегоСтатуса.Получить(Номенклатура);
				СтрокаПлана.Выполнено = (ВесАнализа = 2);
				СтрокаПлана.ФактВРаботе = (ВесАнализа = 1);
			КонецЦикла;
			
		Иначе
			
			// Обычная услуга: раздача фактов по хронологии один к одному.
			СтрокиПлана = ОтсортироватьПоДате(СтрокиПлана);
			Список = ФактУслугПоНоменклатуре.Получить(Номенклатура);
			ИндексФакта = 0;
			КоличествоФактов = ?(Список = Неопределено, 0, Список.Количество());
			
			Для Каждого СтрокаПлана Из СтрокиПлана Цикл
				Если ИндексФакта < КоличествоФактов Тогда
					ЭлементФакта = Список[ИндексФакта];
					СтрокаПлана.ДатаФакта = ЭлементФакта.Дата;
					СтрокаПлана.Выполнено = ЭлементФакта.Выполнено;
					СтрокаПлана.ФактВРаботе = Не ЭлементФакта.Выполнено;
					ИндексФакта = ИндексФакта + 1;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры

Функция ОтсортироватьПоДате(СтрокиПлана)
	
	Массив = Новый Массив;
	Для Каждого Строка Из СтрокиПлана Цикл
		Массив.Добавить(Строка);
	КонецЦикла;
	
	Для Сч1 = 0 По Массив.ВГраница() - 1 Цикл
		Для Сч2 = 0 По Массив.ВГраница() - Сч1 - 1 Цикл
			Если Массив[Сч2].ДатаНачала > Массив[Сч2 + 1].ДатаНачала Тогда
				Буфер = Массив[Сч2];
				Массив[Сч2] = Массив[Сч2 + 1];
				Массив[Сч2 + 1] = Буфер;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Группировка плана по этапам в порядке перечисления + веха первичного приёма.
Функция СгруппироватьПоЭтапам(ТаблицаПлана, ПервичныйПрием, ДатаПриема)
	
	ПорядокЭтапов = Новый Массив;
	ПорядокЭтапов.Добавить(Перечисления.ЭтапыМаршрутаПациента.Консультация);
	ПорядокЭтапов.Добавить(Перечисления.ЭтапыМаршрутаПациента.ДиагностикаЛабораторная);
	ПорядокЭтапов.Добавить(Перечисления.ЭтапыМаршрутаПациента.ДиагностикаИнструментальная);
	ПорядокЭтапов.Добавить(Перечисления.ЭтапыМаршрутаПациента.Лечение);
	ПорядокЭтапов.Добавить(Перечисления.ЭтапыМаршрутаПациента.ДинамическийКонтроль);
	
	Этапы = Новый Массив;
	
	Для Каждого ЗначениеЭтапа Из ПорядокЭтапов Цикл
		
		ДанныеЭтапа = Новый Структура("Этап, Представление, Услуги",
			ЗначениеЭтапа, Строка(ЗначениеЭтапа), Новый Массив);
		
		// Веха первичного приёма — на этапе "Консультация".
		Если ЗначениеЭтапа = Перечисления.ЭтапыМаршрутаПациента.Консультация Тогда
			Веха = Новый Структура(
				"Представление, ДатаНачала, ДатаОкончания, ДатаФакта, Статус, ЭтоВеха, ЭтоПериод, Дозировка, ПриемовВДень, ЕдиницаИзмерения");
			Веха.Представление = "Первичный приём — " + ПервичныйПрием;
			Веха.ДатаНачала = ДатаПриема;
			Веха.ДатаОкончания = ДатаПриема;
			Веха.ДатаФакта = '00010101';
			Веха.Статус = "веха";
			Веха.ЭтоВеха = Истина;
			Веха.ЭтоПериод = Ложь;
			ДанныеЭтапа.Услуги.Добавить(Веха);
		КонецЕсли;
		
		СтрокиЭтапа = ТаблицаПлана.НайтиСтроки(Новый Структура("Этап", ЗначениеЭтапа));
		Для Каждого СтрокаПлана Из СтрокиЭтапа Цикл
			
			Услуга = Новый Структура(
				"Представление, ДатаНачала, ДатаОкончания, ДатаФакта, Статус, ЭтоВеха, ЭтоПериод, Дозировка, ПриемовВДень, ЕдиницаИзмерения");
			Услуга.Представление = Строка(СтрокаПлана.Номенклатура);
			Услуга.ДатаНачала = ?(ЗначениеЗаполнено(СтрокаПлана.ДатаНачала),
				НачалоДня(СтрокаПлана.ДатаНачала), ДатаПриема);
			Услуга.ДатаФакта = ?(ЗначениеЗаполнено(СтрокаПлана.ДатаФакта),
				НачалоДня(СтрокаПлана.ДатаФакта), '00010101');
			Услуга.ЭтоВеха = Ложь;
			Услуга.Дозировка = СтрокаПлана.Дозировка;
			Услуга.ПриемовВДень = СтрокаПлана.ПриемовВДень;
			Услуга.ЕдиницаИзмерения = СтрокаПлана.ЕдиницаИзмерения;
			
			Если ЗначениеЗаполнено(СтрокаПлана.ДатаОкончания)
					И НачалоДня(СтрокаПлана.ДатаОкончания) > Услуга.ДатаНачала Тогда
				Услуга.ДатаОкончания = НачалоДня(СтрокаПлана.ДатаОкончания);
				Услуга.ЭтоПериод = Истина;
			Иначе
				Услуга.ДатаОкончания = Услуга.ДатаНачала;
				Услуга.ЭтоПериод = Ложь;
			КонецЕсли;
			
			Услуга.Статус = СтатусУслуги(СтрокаПлана);
			ДанныеЭтапа.Услуги.Добавить(Услуга);
			
		КонецЦикла;
		
		Этапы.Добавить(ДанныеЭтапа);
		
	КонецЦикла;
	
	Возврат Этапы;
	
КонецФункции  
Функция МаршрутыПациентаДляВыбора(Пациент) Экспорт
	
	Отбор = Новый Структура("Пациент", Пациент);
	ТаблицаМаршрутов = СписокМаршрутов(Отбор);
	
	Список = Новый СписокЗначений;
	Для Каждого Строка Из ТаблицаМаршрутов Цикл
		Значение = Новый Структура("ПервичныйПрием, СтандартЛечения",
			Строка.ПервичныйПрием, Строка.СтандартЛечения);
		Представление = Строка.ПредставлениеМаршрута
			+ " (от " + Формат(Строка.ДатаНазначения, "ДЛФ=D") + ")"
			+ ?(Строка.Завершен, " — завершён", "");
		Список.Добавить(Значение, Представление);
	КонецЦикла;
	Возврат Список;
	
КонецФункции
Функция МаршрутыПациентаТаблица(Пациент) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ПервичныйПрием",        Новый ОписаниеТипов("ДокументСсылка.Прием"));
	Результат.Колонки.Добавить("СтандартЛечения",       Новый ОписаниеТипов("СправочникСсылка.СтандартыЛечения"));
	Результат.Колонки.Добавить("ПредставлениеМаршрута", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДатаНазначения",        Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("Завершен",              Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Итог");
	
	Если Не ЗначениеЗаполнено(Пациент) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Отбор = Новый Структура("Пациент", Пациент);
	ТаблицаМаршрутов = СписокМаршрутов(Отбор);
	Для Каждого Строка Из ТаблицаМаршрутов Цикл
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция СтатусУслуги(СтрокаПлана) 
	Если ЗначениеЗаполнено(СтрокаПлана.РучнойСтатус) Тогда
		Если СтрокаПлана.РучнойСтатус
				= Перечисления.СтатусыВыполненияПозицииМаршрута.Выполнено Тогда
			Возврат "выполнено";
		ИначеЕсли СтрокаПлана.РучнойСтатус
				= Перечисления.СтатусыВыполненияПозицииМаршрута.Выполняется Тогда
			Возврат "в работе";
		ИначеЕсли СтрокаПлана.РучнойСтатус
				= Перечисления.СтатусыВыполненияПозицииМаршрута.Отказ Тогда
			Возврат "отказ";
		ИначеЕсли СтрокаПлана.РучнойСтатус
				= Перечисления.СтатусыВыполненияПозицииМаршрута.Отменено Тогда
			Возврат "отменено";
		КонецЕсли;
	КонецЕсли;
	
	// 2. Автоматический статус — из регистра АвтоСтатусыПозицийМаршрута.
	Если ЗначениеЗаполнено(СтрокаПлана.АвтоСтатус) Тогда
		Возврат СтрокаПлана.АвтоСтатус;
	КонецЕсли;
	
	// 3. Запасной случай — если в регистре по позиции нет записи
	// (например, пересчёт ещё не отработал). Возвращаем "запланировано".
	Возврат "запланировано";	
КонецФункции 
// Возвращает таблицу маршрутов по отбору.
//  Отбор - Структура: Пациент, СтандартЛечения, Филиал, Организация, Врач,
//                     ДатаС, ДатаПо, ТолькоНезавершенные
Функция СписокМаршрутов(Отбор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пациент",         ПолучитьЗначениеОтбора(Отбор, "Пациент"));
	Запрос.УстановитьПараметр("СтандартЛечения",  ПолучитьЗначениеОтбора(Отбор, "СтандартЛечения"));
	Запрос.УстановитьПараметр("Филиал",           ПолучитьЗначениеОтбора(Отбор, "Филиал"));
	Запрос.УстановитьПараметр("Организация",      ПолучитьЗначениеОтбора(Отбор, "Организация"));
	Запрос.УстановитьПараметр("Врач",             ПолучитьЗначениеОтбора(Отбор, "Врач"));
	Запрос.УстановитьПараметр("ДатаС",            ПолучитьЗначениеОтбора(Отбор, "ДатаС"));
	Запрос.УстановитьПараметр("ДатаПо",           ПолучитьЗначениеОтбора(Отбор, "ДатаПо"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Этапы.ПервичныйПрием КАК ПервичныйПрием,
	|	Этапы.СтандартЛечения КАК СтандартЛечения,
	|	Этапы.ПервичныйПрием.Дата КАК ДатаНазначения,
	|	Этапы.ПервичныйПрием.Дата КАК ДатаПриема,
	|	Этапы.ПервичныйПрием.Клиент КАК Пациент,
	|	Этапы.ПервичныйПрием.Филиал КАК Филиал,
	|	Этапы.ПервичныйПрием.Филиал.Организация КАК Организация,
	|	Этапы.ПервичныйПрием.Врач КАК Врач
	|ИЗ
	|	РегистрСведений.ЭтапыНазначенийПланаЛечения КАК Этапы
	|ГДЕ
	|	(&Пациент = НЕОПРЕДЕЛЕНО
	|		ИЛИ Этапы.ПервичныйПрием.Клиент = &Пациент)
	|	И (&СтандартЛечения = НЕОПРЕДЕЛЕНО
	|		ИЛИ Этапы.СтандартЛечения = &СтандартЛечения)
	|	И (&Филиал = НЕОПРЕДЕЛЕНО
	|		ИЛИ Этапы.ПервичныйПрием.Филиал = &Филиал)
	|	И (&Организация = НЕОПРЕДЕЛЕНО
	|		ИЛИ Этапы.ПервичныйПрием.Филиал.Организация = &Организация)
	|	И (&Врач = НЕОПРЕДЕЛЕНО
	|		ИЛИ Этапы.ПервичныйПрием.Врач = &Врач)
	|	И (&ДатаС = НЕОПРЕДЕЛЕНО
	|		ИЛИ Этапы.ПервичныйПрием.Дата >= &ДатаС)
	|	И (&ДатаПо = НЕОПРЕДЕЛЕНО
	|		ИЛИ Этапы.ПервичныйПрием.Дата <= &ДатаПо)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пациент,
	|	ДатаНазначения УБЫВ";
	
	ТаблицаМаршрутов = Запрос.Выполнить().Выгрузить();
	ТаблицаМаршрутов.Колонки.Добавить("Завершен", Новый ОписаниеТипов("Булево"));
	ТаблицаМаршрутов.Колонки.Добавить("Итог");
	ТаблицаМаршрутов.Колонки.Добавить("ПредставлениеМаршрута", Новый ОписаниеТипов("Строка"));
	
	ТолькоНезавершенные = ПолучитьЗначениеОтбора(Отбор, "ТолькоНезавершенные") = Истина;
	СтрокиКУдалению = Новый Массив;
	Для Каждого Строка Из ТаблицаМаршрутов Цикл
		Строка.ПредставлениеМаршрута = "Маршрут лечения «" + Строка(Строка.СтандартЛечения) + "»";
		ИтогМаршрута = ПрочитатьИтогЛечения(Строка.ПервичныйПрием);
		Если ИтогМаршрута <> Неопределено Тогда
			Строка.Завершен = Истина;
			Строка.Итог = ИтогМаршрута.Итог;
		КонецЕсли;
		Если ТолькоНезавершенные И Строка.Завершен Тогда
			СтрокиКУдалению.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Строка Из СтрокиКУдалению Цикл
		ТаблицаМаршрутов.Удалить(Строка);
	КонецЦикла;
	Возврат ТаблицаМаршрутов;
	
КонецФункции

Функция ПолучитьЗначениеОтбора(Отбор, Имя)
	
	Значение = Неопределено;
	Если Отбор.Свойство(Имя) И ЗначениеЗаполнено(Отбор[Имя]) Тогда
		Значение = Отбор[Имя];
	КонецЕсли;
	Возврат Значение;
	
КонецФункции
Функция ПолучитьКорректировки(ПервичныйПрием, СтандартЛечения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПервичныйПрием", ПервичныйПрием);
	Запрос.УстановитьПараметр("СтандартЛечения", СтандартЛечения);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Корр.ИдентификаторНазначения КАК ИдентификаторНазначения,
	|	Корр.ВидКорректировки КАК ВидКорректировки,
	|	Корр.Номенклатура КАК Номенклатура,
	|	Корр.Этап КАК Этап,
	|	Корр.СтандартЛечения КАК СтандартЛечения,
	|	Корр.ДатаНачала КАК ДатаНачала,
	|	Корр.ДатаОкончания КАК ДатаОкончания,
	|	Корр.Количество КАК Количество,
	|	Корр.Дозировка КАК Дозировка,
	|	Корр.ПриемовВДень КАК ПриемовВДень,
	|	Корр.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.КорректировкиПланаЛечения.СрезПоследних(
	|		, ПервичныйПрием = &ПервичныйПрием) КАК Корр
	|ГДЕ
	|	Корр.СтандартЛечения = &СтандартЛечения";
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = Новый Структура(
			"ВидКорректировки, Номенклатура, Этап, СтандартЛечения, ДатаНачала, ДатаОкончания, Количество, Дозировка, ПриемовВДень, ЕдиницаИзмерения");
		ЗаполнитьЗначенияСвойств(Стр, Выборка);
		Результат.Вставить(Выборка.ИдентификаторНазначения, Стр);
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Процедура ПрименитьКорректировки(ТаблицаПлана, Корректировки) Экспорт
	
	Для Каждого Элемент Из Корректировки Цикл
		
		Ид = Элемент.Ключ;
		Корр = Элемент.Значение;
		Строки = ТаблицаПлана.НайтиСтроки(Новый Структура("ИдентификаторНазначения", Ид));
		
		Если Корр.ВидКорректировки = Перечисления.ВидыКорректировокПланаЛечения.УдалениеПозиции Тогда
			
			Для Каждого Строка Из Строки Цикл
				ТаблицаПлана.Удалить(Строка);
			КонецЦикла;
			
		ИначеЕсли Строки.Количество() > 0 Тогда
			
			// Изменение существующей позиции.
			Для Каждого Строка Из Строки Цикл
				Если ЗначениеЗаполнено(Корр.Номенклатура) Тогда
					Строка.Номенклатура = Корр.Номенклатура;
				КонецЕсли;
				Если ЗначениеЗаполнено(Корр.Этап) Тогда
					Строка.Этап = Корр.Этап;
				КонецЕсли;
				Строка.ДатаНачала = Корр.ДатаНачала;
				Строка.ДатаОкончания = Корр.ДатаОкончания;
				Строка.Количество = Корр.Количество;
				Строка.Дозировка = Корр.Дозировка;
				Строка.ПриемовВДень = Корр.ПриемовВДень;
				Строка.ЕдиницаИзмерения = Корр.ЕдиницаИзмерения;
			КонецЦикла;
			
		Иначе
			
			// Добавление новой позиции (а также изменение позиции,
			// которой нет в плане — трактуем как добавление).
			НоваяСтрока = ТаблицаПлана.Добавить();
			НоваяСтрока.ИдентификаторНазначения = Ид;
			НоваяСтрока.Номенклатура = Корр.Номенклатура;
			НоваяСтрока.Этап = Корр.Этап;
			НоваяСтрока.СтандартЛечения = Корр.СтандартЛечения;
			НоваяСтрока.ДатаНачала = Корр.ДатаНачала;
			НоваяСтрока.ДатаОкончания = Корр.ДатаОкончания;
			НоваяСтрока.Количество = Корр.Количество;
			НоваяСтрока.Дозировка = Корр.Дозировка;
			НоваяСтрока.ПриемовВДень = Корр.ПриемовВДень;
			НоваяСтрока.ЕдиницаИзмерения = Корр.ЕдиницаИзмерения;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
Функция МаршрутыПациентаДляПлашки(Пациент, ИсключаемыйПриём = Неопределено) Экспорт
	
	// Возвращает СписокЗначений незавершённых маршрутов пациента,
	// исключая маршруты, где первичный приём равен ИсключаемыйПриём.
	
	Отбор = Новый Структура("Пациент, ТолькоНезавершенные", Пациент, Истина);
	ТаблицаМаршрутов = СписокМаршрутов(Отбор);
	
	Список = Новый СписокЗначений;
	Для Каждого Строка Из ТаблицаМаршрутов Цикл
		Если ЗначениеЗаполнено(ИсключаемыйПриём)
			И Строка.ПервичныйПрием = ИсключаемыйПриём Тогда
			Продолжить;
		КонецЕсли;
		Значение = Новый Структура("ПервичныйПрием, СтандартЛечения",
			Строка.ПервичныйПрием, Строка.СтандартЛечения);
		Представление = Строка.ПредставлениеМаршрута
			+ " (от " + Формат(Строка.ДатаНазначения, "ДЛФ=D") + ")";
		Список.Добавить(Значение, Представление);
	КонецЦикла;
	Возврат Список;
	
КонецФункции

Функция ЕстьСобственныйМаршрут(Прием) Экспорт
	
	Если Не ЗначениеЗаполнено(Прием) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПервичныйПрием", Прием);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле
	|ИЗ
	|	РегистрСведений.ЭтапыНазначенийПланаЛечения КАК ЭтапыНазначений
	|ГДЕ
	|	ЭтапыНазначений.ПервичныйПрием = &ПервичныйПрием";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции
// Возвращает приём, который является отправной точкой маршрута для текущего документа Прием.
// Логика:
//  1. Если по текущему приёму уже есть записи в ЭтапыНазначенийПланаЛечения
//     (он уже зафиксирован как отправной для какого-то маршрута) — возвращаем сам приём.
//  2. Иначе если в плане текущего приёма СписокНазначений есть позиции
//     с заполненными этапом и стандартом — этот приём становится отправным
//     (мы вот-вот запишем маршрут).
//  3. Иначе у приёма маршрута нет.
Функция ОтправнойПриемМаршрута(Прием) Экспорт
	
	Если Не ЗначениеЗаполнено(Прием) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Прием", Прием);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле
	|ИЗ
	|	РегистрСведений.ЭтапыНазначенийПланаЛечения КАК ЭтапыНазначений
	|ГДЕ
	|	ЭтапыНазначений.ПервичныйПрием = &Прием";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Прием;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
